package demo1;

public class 笔记 {
	public static void main(String[] args) {
		/*
		 * 1. JDK是java程序的开发与运行环境
		 * 	  JRE是java程序的运行环境
		 * 
		 * 
		 * 2. JDK、JRE和JVM之间的关系
		 * 	  JDK是java程序的开发与运行环境，JDK包含了JRE，
		 *    同时还包含了编译java源码的编译器javac，还包含了很多java程序调试和分析的工具
		 *    
		 *    JRE顾名思义是java运行时环境，包含了java虚拟机，java基础类库。
		 *    JDK包含在JRE之中用于在相应的操作系统平台上运行java字节码文件

		 * 
		 * 3. java程序的跨平台特性
		 *    java程序可以在任意类型的操作系统上运行（平台无关性）
		 *    java语言的平台无关性是由JVM（java虚拟机）实现的。
		 *    不同的操作系统会有与之对应的JVM，从而实现java程序的平台无关性
		 *    
		 *    
		 * 4. java程序的执行过程（编写-->编译-->解释执行）
		 * 	  java程序的源文件（.java文件）经过java编译器编译之后
		 *    会得到一个java字节码文件（.class文件），这个字节码文件
		 *    能够在相应平台上的JVM上运行。
		 *    
		 *  
		 * 5. java的解释器（是JVM的一部分）
		 *    Java解释器：解释器是Java虚拟机非常重要的一部分，
		 *    它的工作就是把字节码转化为机器码并在特定的平台进行运行。
		 *  
		 *    
		 * 6. 注意：在编写Java程序时，主类的名称要和当前.java文件的名称一致，
		 *    并且一个.java文件中只能够含有一个主类。
		 *    主方法只能包含在主类中，是所有Java程序的入口(java程序执行的起点)
		 *    
		 * 
		 * 7. java中的注释
		 * 	  注释是对于Java程序的解释，增强程序的阅读性。
		 *    编译器在编译Java程序时会自动忽略注释内容。
		 * 	  java中包含三种注释：行注释、块注释、文档注释。
		 * 
		 * 
		 * 8. Java程序中的关键字
		 * 	  关键字是java程序中预定义的具有特殊含义的单词。
		 * 	  所有的关键字都是小写的
		 * 	  java关键字中还包括一些保留字（暂时不用的关键字）
		 * 
		 * 9. Java程序中的标识符（除了关键字以外的单词）
		 * 	  标识符是用于标识变量、方法、类、接口的程序员自定义的单词。
		 * 	  标识符的命名规则：标识符是由字母（大小写）、数字、下划线和 $ 组成的
		 *    并且标识符不能够以数字开头。
		 *    
		 *    注意：标识符不能够和关键字重名 
		 *          Java程序严格区分大小写  
		 *     
		 *    标识符的命名规范（驼峰式命名）
		 *    (1)方法、变量名以小写字母开头
		 *    (2)类名、接口名以大写字母开头
		 *    (3)常量名全部都是由大写字母组成   
		 *  
		 * 
		 *  10.java程序中的数据类型
		 *  	主要包括：基本数据类型和引用数据类型
		 *  	基本数据类型包括：byte、short、int、long、float、double、boolean、char
		 *  	引用数据类型包括：对象、数组、接口等...


		 *  11.java程序中的字面量
		 *  	各种基本数据类型的字面量
		 *  	Java程序中整型字面量默认是int类型的，浮点型字面量默认是double类型的
		 *      整型字面量：二进制、八进制、十进制、十六进制的表示方法
		 *      字符串字面量用""包裹，其中更可以包含多个字符(0-n个字符)
		 *      字符字面量用''包裹，其中只能包含一个字符
		 *  
		 *  
		 * 
		 * 
		 
		 *    
		 * 	  
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * */
	}
}
